Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/deserted_wife_s_payments.html.txt.tmx
Source language: en
Languages: ga

source: Deserted Wife's Benefit and Deserted Wife’s Allowance are two social welfare payments made to women who were deserted by their husbands
ga: Is dhá íocaíocht iad Sochar Banchéile Thréigthe agus Liúntas Banchéile Thréigthe a íoctar le mná ar thréig a bhfear céile iad

source: Both of these payments were closed to new applications in January 1997, when the One-Parent Family Payment was introduced. Some women have continued to get Deserted Wife’s Benefit because they qualified for the payment before 2 January 1997 and have continued to meet the qualifying criteria
ga: Dúnadh an dá íocaíocht seo d'iarratais nua i mí Eanáir 1997 nuair a seoladh an Íocaíocht Teaghlaigh Aontuismitheora Leanadh le híoc Sochair Bhanchéile Thréigthe agus Liúntais Bhanchéile Thréigthe le roinnt ban mar bhí siad cáilithe don íocaíocht roimh 2 Eanáir 1997 agus comhlíonann siad na critéir cháilithe go fóill

source: Deserted Wife's Benefit is a payment made to a woman deserted by her husband
ga: Is íocaíocht do bhean ar thréig a fear céile í an Sochar Banchéile Thréigthe

source: Entitlement to the payment is based on social insurance contributions paid by the woman or her husband
ga: Tá teidlíocht don íocaíocht bunaithe ar ranníocaíochtaí árachais shóisialaigh atá íoctha ag an mbean nó ag a fear céile

source: If you have transfered from Deserted Wife’s Benefit to One-Parent Family Payment to be accepted as a participant on a Community Employment Scheme, you can apply to have your entitlement to Deserted Wife's Benefit restored
ga: Má tá go leor ranníocaíochtaí ÁSPC íoctha agat (ní ag d'fhear céile) is féidir leat aistriú go Pinsean Stáit (Idirthréimse) agus 65 bliain d'aois sroichte agat

source: The maximum weekly rate of payment for Deserted Wife’s Benefit is higher than the maximum weekly rate of One-Parent Family Payment
ga: Íoctar Pinsean Stáit (Aistriú) ag ráta níos airde ná an Sochar Banchéile Thréigthe

source: If you qualify to have your entitlement to Deserted Wife’s Benefit restored you may also be due arrears
ga: Is féidir le mná atá ag fáil Sochar Banchéile Thréigthe aistriú go Pinsean Stáit (Ranníocach) nuair atá 66 bliain d'aois sroichte acu

source: Women getting Deserted Wife’s Benefit can apply for and transfer to the State Pension (Contributory) when they reach 66
ga: Má cháilíonn tú d'athbhunú do theidlíochta don Sochar Banchéile Thréigthe tá seans ann go mbeidh riaráistí ag dul duit chomh maith

source: If you are currently getting a reduced rate of Deserted Wife's Benefit, but have been working, then you may qualify for a higher rate of State Pension (Contributory), based on your own PRSI contributions, when you reach 66
ga: Is íocaíocht de réir tástála acmhainne an Liúntas Banchéile Thréigthe do mhná faoi 66 bliain d'aois, nach bhfuil leanaí cleithiúnacha acu agus ar thréig a bhfear céile iad agus nach bhfuil cáilithe don Sochar Banchéile Thréigthe

source: However if you do not qualify for the State Pension (Contributory) when you reach 66 you will automatically get a higher rate of Deserted Wife's Benefit (see 'Rates' below)
ga: Aistreofar go huathoibríoch mná atá ag fáil an Liúntais Bhanchéile Thréigthe go dtí Pinsean Stáit (Neamh-Ranníocach) nuair atá 66 bliain d'aois bainte amach acu

source: In 2016 and before March 2017:
ga: Rátaí do Shochar Banchéile Thréigthe í 2016 agus roimh Márta 2017

source: │PRSI │Rate per │Rate per week (aged 66 or │ │Contributions │week │over) │
ga: │ÁSPC │aghaidh na │seachtaine: os cionn │ │ │seachtaine │aois 66 │

source: │48 or over │€193.50 │€233.30 │
ga: │48 nó os a │€193.50 │€233.30 │

source: │PRSI │Rate per week (aged │Rate per week (aged 66│
ga: │Ranníocaíochtaí│aghaidh na │seachtaine: os cionn │

source: │Contributions│under 66 - from 16 │or over - from 9 │
ga: │ÁSPC │seachtaine (ó │aois 66 (ó 9 Márta) │

source: │48 or over │€198.50 │€238.30 │
ga: │48 nó os a │€198.50 │€238.30 │

source: You may also get an increase in your payment for child dependents and extra benefits such as Living Alone Allowance and Fuel Allowance
ga: Rátaí laghdaithe Sochair Bhanchéile Thréigthe

source: Any new application for Deserted Wife’s Benefit received on or after 31 August 1992 is subject to an earnings limit as well as satisfying the PRSI contribution condition
ga: Tá seans ann freisin go bhfaighidh tú ráta laghdaithe Sochair mura bhfuil go leor ranníocaíochtaí ÁSPC íoctha agat chun a bheith cáilithe don uasráta

source: Since May 2007, you will get one of the rates of Deserted Wife’s Benefit in the table above if your yearly income is less than €20,000
ga: Is féidir le do thuilleamh agus gan go leor ranníocaíochtaí ÁSPC a bheith íoctha agat ag an am céanna d'íocaíocht a laghdú

source: It is important to note, a reduced rate of Deserted Wife's Benefit based on earnings or insufficient PRSI contributions does not apply to claims made before 31 August 1992
ga: Tugtar faoi deara le do thoil nach mbaineann ráta laghdaithe Sochair Bhanchéile Thréigthe bunaithe ar thuilleamh nógan go leor íocaíochtaí ÁSPC a bheith íoctha agat le héilimh a cuireadh isteach roimh an 31 Lúnasa 1992

source: How to apply
ga: Conas iarratas a dhéanamh

source: If you are getting Deserted Wife's Benefit, you may be entitled to extra benefits from the Department of Social Protection including a Living Alone Allowance and the Household Benefits Package when you turn 66
ga: Ní féidir iarratas a chur isteach a thuilleadh ar Shochar Banchéile Thréigthe ná ar Liúntas Banchéile Thréigthe - dúnadh na híocaíochtaí seo d' iarratasóirí nua ó Eanáir 1997 i leith
